IDEA Open Model
IGeometryPart Interface
Compatible with IDEA StatiCa 20.1
 Geotery interface
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public interface IGeometryPart
Public Interface IGeometryPart
The IGeometryPart type exposes the following members.
Properties
Name | Description
Edges
 Lines of input edges on wall or beam
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace